Ran Plan for dir: `terragrunt/kubernetes/renovate` workspace: `terragrunt_kubernetes_renovate`

<details><summary>Show Output</summary>

```diff
Authenticated

01:02:06.451 INFO   Downloading Terraform configurations from . into ./.terragrunt-cache/ilC5q2u9bX8ifkgp5uLcmmLlcfM/Yt35jikts9Kg22St8FBsu4VFMKA
01:02:06.476 INFO   tofu: Initializing the backend...
01:02:06.755 INFO   tofu: Initializing provider plugins...
01:02:06.755 INFO   tofu: - Reusing previous version of hashicorp/kubernetes from the dependency lock file
01:02:06.991 INFO   tofu: - Reusing previous version of hashicorp/helm from the dependency lock file
01:02:07.096 INFO   tofu: - Reusing previous version of goauthentik/authentik from the dependency lock file
01:02:07.248 INFO   tofu: - Reusing previous version of gavinbunney/kubectl from the dependency lock file
01:02:07.328 INFO   tofu: - Reusing previous version of aminueza/minio from the dependency lock file
01:02:07.447 INFO   tofu: - Reusing previous version of cloudflare/cloudflare from the dependency lock file
01:02:07.602 INFO   tofu: - Reusing previous version of hashicorp/vault from the dependency lock file
01:02:07.714 INFO   tofu: - Reusing previous version of telmate/proxmox from the dependency lock file
01:02:07.887 INFO   tofu: - Using previously-installed cloudflare/cloudflare v5.4.0
01:02:07.907 INFO   tofu: - Using previously-installed hashicorp/vault v4.8.0
01:02:07.918 INFO   tofu: - Using previously-installed telmate/proxmox v3.0.1-rc8
01:02:07.951 INFO   tofu: - Using previously-installed hashicorp/kubernetes v2.36.0
01:02:07.987 INFO   tofu: - Using previously-installed hashicorp/helm v3.0.0-pre2
01:02:08.008 INFO   tofu: - Using previously-installed goauthentik/authentik v2025.8.1
01:02:08.043 INFO   tofu: - Using previously-installed gavinbunney/kubectl v1.19.0
01:02:08.058 INFO   tofu: - Using previously-installed aminueza/minio v3.5.0
01:02:08.058 INFO   tofu: OpenTofu has been successfully initialized!
01:02:08.688 STDOUT tofu: OpenTofu used the selected providers to generate the following execution
01:02:08.688 STDOUT tofu: plan. Resource actions are indicated with the following symbols:
01:02:08.689 STDOUT tofu:   ~ update in-place
01:02:08.689 STDOUT tofu: OpenTofu will perform the following actions:
01:02:08.689 STDOUT tofu:   # helm_release.renovate will be updated in-place
01:02:08.689 STDOUT tofu:   ~ resource "helm_release" "renovate" {
01:02:08.689 STDOUT tofu:       ~ id                         = "renovate" -> (known after apply)
01:02:08.689 STDOUT tofu:       ~ metadata                   = {
01:02:08.689 STDOUT tofu:           ~ app_version    = "43.4.1" -> (known after apply)
01:02:08.689 STDOUT tofu:           ~ chart          = "renovate" -> (known after apply)
01:02:08.689 STDOUT tofu:           ~ first_deployed = 1746674676 -> (known after apply)
01:02:08.689 STDOUT tofu:           ~ last_deployed  = 1770466192 -> (known after apply)
01:02:08.689 STDOUT tofu:           ~ name           = "renovate" -> (known after apply)
01:02:08.689 STDOUT tofu:           ~ namespace      = "renovate" -> (known after apply)
01:02:08.689 STDOUT tofu:           ~ revision       = 73 -> (known after apply)
01:02:08.689 STDOUT tofu:           ~ values         = jsonencode(
01:02:08.689 STDOUT tofu:                 {
01:02:08.689 STDOUT tofu:                   - envFrom  = [
01:02:08.689 STDOUT tofu:                       - {
01:02:08.689 STDOUT tofu:                           - secretRef = {
01:02:08.689 STDOUT tofu:                               - name = "renovate-env"
01:02:08.689 STDOUT tofu:                             }
01:02:08.689 STDOUT tofu:                         },
01:02:08.689 STDOUT tofu:                     ]
01:02:08.689 STDOUT tofu:                   - renovate = {
01:02:08.689 STDOUT tofu:                       - config = jsonencode(
01:02:08.689 STDOUT tofu:                             {
01:02:08.689 STDOUT tofu:                               - gitAuthor    = "YouHide Renovate Bot <youhide_renovate@none.com>"
01:02:08.689 STDOUT tofu:                               - platform     = "github"
01:02:08.689 STDOUT tofu:                               - repositories = [
01:02:08.689 STDOUT tofu:                                   - "youhide/hideForming",
01:02:08.689 STDOUT tofu:                                 ]
01:02:08.689 STDOUT tofu:                             }
01:02:08.689 STDOUT tofu:                         )
01:02:08.689 STDOUT tofu:                     }
01:02:08.689 STDOUT tofu:                 }
01:02:08.689 STDOUT tofu:             ) -> (known after apply)
01:02:08.689 STDOUT tofu:           ~ version        = "46.4.1" -> (known after apply)
01:02:08.689 STDOUT tofu:         } -> (known after apply)
01:02:08.689 STDOUT tofu:         name                       = "renovate"
01:02:08.689 STDOUT tofu:       ~ version                    = "46.4.1" -> "46.4.2"
01:02:08.689 STDOUT tofu:         # (26 unchanged attributes hidden)
01:02:08.689 STDOUT tofu:     }
01:02:08.689 STDOUT tofu: Plan: 0 to add, 1 to change, 0 to destroy.
01:02:08.689 STDOUT tofu:
```
</details>

* :arrow_forward: To **apply** this plan, comment:
  ```shell
  atlantis apply -d terragrunt/kubernetes/renovate -w terragrunt_kubernetes_renovate
  ```
* :put_litter_in_its_place: To **delete** this plan and lock, click [here](http://atlantis.localdomain:4141/lock?id=youhide%252FhideForming%252Fterragrunt%252Fkubernetes%252Frenovate%252Fterragrunt_kubernetes_renovate)
* :repeat: To **plan** this project again, comment:
  ```shell
  atlantis plan -d terragrunt/kubernetes/renovate -w terragrunt_kubernetes_renovate
  ```
Plan: 0 to add, 1 to change, 0 to destroy.

---
* :fast_forward: To **apply** all unapplied plans from this Pull Request, comment:
  ```shell
  atlantis apply
  ```
* :put_litter_in_its_place: To **delete** all plans and locks from this Pull Request, comment:
  ```shell
  atlantis unlock
  ```